{
 "cells": [
  {
   "cell_type": "raw",
   "id": "7572b2cc-e1d3-453f-88db-c24d7b98cf98",
   "metadata": {},
   "source": [
    "Голенищев Артём Эдуардович, ИИ-1"
   ]
  },
  {
   "cell_type": "raw",
   "id": "39f51740-0047-4310-bc7a-03667b094888",
   "metadata": {},
   "source": [
    "Задание 1\n",
    "Задан словарь. Напишите программу, которая будет выводить значение по заданному ключу.\n",
    "Примечание:\n",
    "На данном этапе еще не введено понятие \"Функция\", поэтому необходимо создать файл и написать код, который будет похож на примеры из предыдущих разделов. Сначала необходимо объявить переменные, затем написать код, удовлетворяющий условию задания. Для вывода результата необходимо использовать функцию print().\n",
    "Ключи, чьи значения необходимо найти, должны задаваться с помощью функции input(). Т.к. в данной задаче используется функция input(), получение значения ключей типа int не принципиально.\n",
    "Значения для самостоятельной проверки:\n",
    "Подставьте \"Входные данные\" в свою программу и сравните результат с выходными данными.\n",
    "1) Входные данные: {'Hello' : 'Hi', 'Bye' : 'Goodbye', 'List' : 'Array'};\n",
    "Параметр для input() : 'Bye'.\n",
    "Выходные данные: 'Goodbye'. \n",
    "2) Входные данные: {'beep' : 'car'};\n",
    "Параметр для input() : 'beep'.\n",
    "Выходные данные: 'car'.\n",
    "3) Входные данные: {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5};\n",
    "Параметр для input() : 'c'.\n",
    "Выходные данные: 3."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ea166c17-6507-4142-b41e-ee3e887a82bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " Hello\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hi\n",
      "Hi\n"
     ]
    }
   ],
   "source": [
    "dictionary = {'Hello' : 'Hi', 'Bye' : 'Goodbye', 'List' : 'Array'}\n",
    "key = input()\n",
    "print(dictionary.get(key))\n",
    "print(dictionary[key])"
   ]
  },
  {
   "cell_type": "raw",
   "id": "b84d0207-4c24-4ab0-86aa-5ddb9755ce2a",
   "metadata": {},
   "source": [
    "Задание 2\n",
    "Напишите программу, которая будет выполнять действие, обратное заданию 1. Программа должна производить поиск по значению и выдавать ключ.\n",
    "Примечание:\n",
    "На данном этапе еще не введено понятие \"Функция\", поэтому необходимо создать файл и написать код, который будет похож на примеры из предыдущих разделов. Сначала необходимо объявить переменные, затем написать код, удовлетворяющий условию задания. Для вывода результата необходимо использовать функцию print().\n",
    "Значения, чьи ключи необходимо найти, должны задаваться с помощью функции input(). Значения для самостоятельной проверки:\n",
    "Подставьте \"Входные данные\" в свою программу и сравните результат с выходными данными.\n",
    "1) Входные данные: {'Hello' : 'Hi', 'Bye' : 'Goodbye', 'List' : 'Array'};\n",
    "Параметр для input() : 'Hi'.\n",
    "Выходные данные: 'Hello'. \n",
    "2) Входные данные: {'beep' : 'car'};\n",
    "Параметр для input() : 'car'.\n",
    "Выходные данные: 'beep'.\n",
    "3) Входные данные: {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5};\n",
    "Параметр для input() : 5.\n",
    "Выходные данные: 'e'."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d7e4e296-f4ed-4242-9c5a-fa47fb15f1f0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " Hi\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hello\n"
     ]
    }
   ],
   "source": [
    "dictionary = {'Hello' : 'Hi', 'Bye' : 'Goodbye', 'List' : 'Array'}\n",
    "value = input()\n",
    "result = None\n",
    "for key in dictionary:\n",
    "    if dictionary[key] == value:\n",
    "        result = key\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "raw",
   "id": "5451cac1-f9bb-46de-9830-b51595185f84",
   "metadata": {},
   "source": [
    "Задание 3\n",
    "Напишите программу, которая принимает список строк и выводит количество повторений данных строк в списке.\n",
    "Примечание:\n",
    "На данном этапе еще не введено понятие \"Функция\", поэтому необходимо создать файл и написать код, который будет похож на примеры из предыдущих разделов. Сначала необходимо объявить переменные, затем написать код, удовлетворяющий условию задания. Для вывода результата необходимо использовать функцию print().\n",
    "Необходимо реализовать решение с использованием словарей. Значения для самостоятельной проверки:\n",
    "Подставьте \"Входные данные\" в свою программу и сравните результат с выходными данными.\n",
    "1) Входные данные: ['abc', 'bcd', 'abc', 'abd', 'abd', 'dcd', 'abc'].\n",
    "Выходные данные: 3 1 2 1. \n",
    "2) Входные данные: ['aaa', 'bbb', 'ccc'].\n",
    "Выходные данные: 1 1 1.\n",
    "3) Входные данные: ['abc', 'abc', 'abc'].\n",
    "Выходные данные: 3."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f9c35987-b400-4db1-b1a0-219dc2353e12",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[3, 1, 2, 1]\n"
     ]
    }
   ],
   "source": [
    "str_list = ['abc', 'bcd', 'abc', 'abd', 'abd', 'dcd', 'abc']\n",
    "result_dict = {}\n",
    "for s in str_list:\n",
    "    if s in result_dict.keys():\n",
    "        result_dict[s] += 1\n",
    "    else:\n",
    "        result_dict[s] = 1\n",
    "print(list(result_dict.values()))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
